# Update base utils
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "git"
brew "git-lfs"
brew "util-linux"
brew "parallel"
brew "cmake"

# IaC
brew "terraform"
brew "helm"

brew "asdf"

# Setup NodeJS tooling
brew "fnm"

# Setup Go tooling
brew "go"
brew "mockery"
brew "mise"

# Jav-uh...
# brew "openjdk@8"
brew "tomcat"
brew "maven"

# AWS Tools
brew "awscli"
brew "aws-shell"
cask "aws-vpn-client"

# Kubernetes
brew "derailed/k9s/k9s"

# Docker Stuff
cask "docker"

# Shell Hell
brew "tmux"
brew "htop"
brew "nload"
brew "neofetch"
brew "neovim"
brew "yq"
brew "jq"
brew "ffmpeg"
brew "gh"

# Casks n Stuff
cask "amethyst"
cask "dbeaver-community"
cask "discord"
cask "obsidian"
cask "insomnia"
cask "postman"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "waterfox"
cask "wireshark"
cask "zoom"
cask "meetingbar"
cask "kitty"

# # Needed for swiftfin
# brew "carthage"
# brew "swiftformat"
# brew "swiftgen"
